<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"ec6883278e4daf49325bfb545999a2c535b847a76ca9c92ca13ababec50d3bc3","plan_job_ref":"Job Create terraform plan #91 at https://github.com/presentium/infrastructure/actions/runs/10549394915","plan_hash":"bbed91c864f76f3656bbedb9f60facd0b0935894ae70799e554af9bd266bfbca","plan_text_format":"diff","version":"1.44.0","plan_out_hash":"2509b2b936f9b79b14d6ae13f430f5e65ede38ef73ba39f5c1112f58f85d829a"} -->
Terraform plan in __applications__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.vault.vault_auth_backend.kubernetes will be created
+   resource "vault_auth_backend" "kubernetes" {
+       accessor        = (known after apply)
+       disable_remount = false
+       id              = (known after apply)
+       path            = (known after apply)
+       tune            = (known after apply)
+       type            = "kubernetes"
    }

  # module.vault.vault_kubernetes_auth_backend_config.presentium will be created
+   resource "vault_kubernetes_auth_backend_config" "presentium" {
+       backend                = (known after apply)
+       disable_iss_validation = (known after apply)
+       disable_local_ca_jwt   = (known after apply)
+       id                     = (known after apply)
+       kubernetes_ca_cert     = (known after apply)
+       kubernetes_host        = "https://kubernetes.default.svc"
    }

  # module.vault.vault_kubernetes_auth_backend_role.presentium_api will be created
+   resource "vault_kubernetes_auth_backend_role" "presentium_api" {
+       alias_name_source                = (known after apply)
+       backend                          = (known after apply)
+       bound_service_account_names      = [
+           "presentium-api",
        ]
+       bound_service_account_namespaces = [
+           "prod-presentium",
+           "staging-presentium",
        ]
+       id                               = (known after apply)
+       role_name                        = "kubernetes"
+       token_policies                   = [
+           "servers",
        ]
+       token_ttl                        = 3600
+       token_type                       = "default"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Redundant empty provider block

  on modules/vault/provider.tf line 1:
   1: provider "vault" {

Earlier versions of Terraform used empty provider blocks ("proxy provider
configurations") for child modules to declare their need to be passed a
provider configuration by their callers. That approach was ambiguous and is
now deprecated.

If you control this module, you can migrate to the new declaration syntax by
removing all of the empty provider "vault" blocks and then adding or updating
an entry like the following to the required_providers block of module.vault:
    vault = {
      source = "hashicorp/vault"
    }
```
</details>

:memo: Plan generated in [Create terraform plan #91](https://github.com/presentium/infrastructure/actions/runs/10549394915)